// let a = 7;
// let b = '5';
// a = -40;
// // 1..20
// // 21..30
// //30..40
// // ==  ===
// // != !==
// // > < >= <=
// // ===
// //&&
// // ||
// if (a > 0 && a <= 20) {
//     console.log('1');
// }
// else if (a > 20 && a <= 30) {
//     console.log(2);
// }
// else if (a > 30 && a <= 40) {
//     console.log(3);
// }
// else {
//     console.log('Такой квартиры нет');
// }

// генерирую случайное число!
let r = Math.random();
r = r * 10;
r = Math.round(r);
console.log(r);

let userNum = document.querySelector('#user-num');

document.querySelector('#btn').onclick = checkNum;

function checkNum() {
    let num = userNum.value;
    num = parseInt(num);
    console.log(num);
    // isNaN('aaaa') -> true
    // isNaN(4) -> false
    if (isNaN(num)) {
        alert('Введите корректное число');
    }
    else {
        if (num == r) {
            alert('Вы угадали!!!!');
            location.reload();
        }
        else {
            alert('Пробуй еще!');
        }
    }
}



// 2. Создайте кнопку. После первого нажатия кнопка дожна сменить текст на себе на "Не нажимать", и вывести на экран количество оставшихся попыток - 2. После 2 нажатий кнопки, она должна скрыть сама себя.

let tryBtn = document.querySelector('#try');
let count = 3;

function tryF(){
  count--;
  tryBtn.innerHTML = 'Не нажимать';
  alert('осталось попыток: '+ count);
  if(count <= 0){
    tryBtn.style.display = 'none';
  };
};
tryBtn.onclick = tryF;

// 3. Создайте два поля для ввода чисел. После ввода и нажатия кнопки - выведите большее число.

let maxNum = document.querySelector('#maxNum');
let input3_1 = document.querySelector('#input3_1');
let input3_2 = document.querySelector('#input3_2');

function maxNumF(){
  let num3_1 = input3_1.value;
  let num3_2 = input3_2.value;

  if(isNaN(num3_1) || isNaN(num3_2)) {
      alert('Введите корректное число');
  }
  else if(num3_1 > num3_2){
    alert(num3_1);
  }
  else if(num3_2 > num3_1){
    alert(num3_2);
  } 
  else if(num3_2 = num3_1){
    alert('числа равны');
  } 
};
maxNum.onclick = maxNumF;

// 4. Создайте два поля. В одно пользователь вводит день рождения, во второй - месяц (в виде числа). Выведите знак зодиака под каким родился пользователь.

let zodiak = document.querySelector('#zodiak');
let input4_1 = document.querySelector('#input4_1');
let input4_2 = document.querySelector('#input4_2');

function zodiakF(){
  let num4_1 = input4_1.value;
  let num4_2 = input4_2.value;
  (isNaN(num4_1) || isNaN(num4_2)) ? alert('Введите корректное число') :
  (num4_1 >= 21 && num4_2 == 3) ? alert('Вы Овен 21 марта — 19 апреля') :
  (num4_1 <= 19 && num4_2 == 4) ? alert('Вы Овен 21 марта — 19 апреля') :

  (num4_1 >= 20 && num4_2 == 4) ? alert('Вы Телец 20 апреля — 20 мая') :
  (num4_1 <= 20 && num4_2 == 5) ? alert('Вы Телец 20 апреля — 20 мая') :

  (num4_1 >= 21 && num4_2 == 5) ? alert('Вы Близнецы 21 мая — 20 июня') :
  (num4_1 <= 20 && num4_2 == 6) ? alert('Вы Близнецы 21 мая — 20 июня') :

  (num4_1 >= 21 && num4_2 == 6) ? alert('Вы Рак 21 июня — 22 июля') :
  (num4_1 <= 22 && num4_2 == 7) ? alert('Вы Рак 21 июня — 22 июля') :

  (num4_1 >= 23 && num4_2 == 7) ? alert('Вы Лев 23 июля — 22 августа') :
  (num4_1 <= 22 && num4_2 == 8) ? alert('Вы Лев 23 июля — 22 августа') :

  (num4_1 >= 23 && num4_2 == 8) ? alert('Вы Дева 23 августа — 22 сентября') :
  (num4_1 <= 22 && num4_2 == 9) ? alert('Вы Дева 23 августа — 22 сентября') :

  (num4_1 >= 23 && num4_2 == 9) ? alert('Вы Весы 23 сентября — 22 октября') :
  (num4_1 <= 22 && num4_2 == 10) ? alert('Вы Весы 23 сентября — 22 октября') :

  (num4_1 >= 23 && num4_2 == 10) ? alert('Вы Скорпион 23 октября — 21 ноября') :
  (num4_1 <= 21 && num4_2 == 11) ? alert('Вы Скорпион 23 октября — 21 ноября') :

  (num4_1 >= 22 && num4_2 == 11) ? alert('Вы Стрелец 22 ноября — 21 декабря') :
  (num4_1 <= 21 && num4_2 == 12) ? alert('Вы Стрелец 22 ноября — 21 декабря') :

  (num4_1 >= 22 && num4_2 == 12) ? alert('Вы Козерог 22 декабря — 19 января	') :
  (num4_1 <= 19 && num4_2 == 1) ? alert('Вы Козерог 22 декабря — 19 января	') :

  (num4_1 >= 20 && num4_2 == 1) ? alert('Вы Водолей 20 января — 18 февраля') :
  (num4_1 <= 18 && num4_2 == 2) ? alert('Вы Водолей 20 января — 18 февраля') :

  (num4_1 >= 19 && num4_2 == 2) ? alert('Вы Рыбы 19 февраля — 20 марта') :
  (num4_1 <= 20 && num4_2 == 3) ? alert('Вы Рыбы 19 февраля — 20 марта') :

  alert('введи день и месяц рождения');
};

zodiak.onclick = zodiakF;

// 5. Создайте input куда пользователь может ввести год рождения. Программа должна вывести символ года по китайскому календарю. Подумайте как можно упростить программу.

let china = document.querySelector('#china');
let input5_1 = document.querySelector('#input5_1');

// function chinaF(){
//   let num5_1 = input5_1.value;
//   (num5_1 == 1900 || num5_1 == 1900+12 || num5_1 == 1900+12*2 || num5_1 == 1900+12*3 || num5_1 == 1900+12*4 || num5_1 == 1900+12*5 || num5_1 == 1900+12*6 || num5_1 == 1900+12*7 || num5_1 == 1900+12*8 || num5_1 == 1900+12*9 || num5_1 == 1900+12*10 || num5_1 == 1900+12*11 || num5_1 == 1900+12*12) ? alert('ваш год Крысы') :
//   (num5_1 == 1901 || num5_1 == 1901+12 || num5_1 == 1901+12*2 || num5_1 == 1901+12*3 || num5_1 == 1901+12*4 || num5_1 == 1901+12*5 || num5_1 == 1901+12*6 || num5_1 == 1901+12*7 || num5_1 == 1901+12*8 || num5_1 == 1901+12*9 || num5_1 == 1901+12*10 || num5_1 == 1901+12*11 || num5_1 == 1901+12*12) ? alert('ваш год Быка') :
//   (num5_1 == 1902 || num5_1 == 1902+12 || num5_1 == 1902+12*2 || num5_1 == 1902+12*3 || num5_1 == 1902+12*4 || num5_1 == 1902+12*5 || num5_1 == 1902+12*6 || num5_1 == 1902+12*7 || num5_1 == 1902+12*8 || num5_1 == 1902+12*9 || num5_1 == 1902+12*10 || num5_1 == 1902+12*11 || num5_1 == 1902+12*12) ? alert('ваш год Тигра') :
//   (num5_1 == 1903 || num5_1 == 1903+12 || num5_1 == 1903+12*2 || num5_1 == 1903+12*3 || num5_1 == 1903+12*4 || num5_1 == 1903+12*5 || num5_1 == 1903+12*6 || num5_1 == 1903+12*7 || num5_1 == 1903+12*8 || num5_1 == 1903+12*9 || num5_1 == 1903+12*10 || num5_1 == 1903+12*11 || num5_1 == 1903+12*12) ? alert('ваш год Кролика') :
//   (num5_1 == 1904 || num5_1 == 1904+12 || num5_1 == 1904+12*2 || num5_1 == 1904+12*3 || num5_1 == 1904+12*4 || num5_1 == 1904+12*5 || num5_1 == 1904+12*6 || num5_1 == 1904+12*7 || num5_1 == 1904+12*8 || num5_1 == 1904+12*9 || num5_1 == 1904+12*10 || num5_1 == 1904+12*11 || num5_1 == 1904+12*12) ? alert('ваш год Дракона') :
//   (num5_1 == 1905 || num5_1 == 1905+12 || num5_1 == 1905+12*2 || num5_1 == 1905+12*3 || num5_1 == 1905+12*4 || num5_1 == 1905+12*5 || num5_1 == 1905+12*6 || num5_1 == 1905+12*7 || num5_1 == 1905+12*8 || num5_1 == 1905+12*9 || num5_1 == 1905+12*10 || num5_1 == 1905+12*11 || num5_1 == 1905+12*12) ? alert('ваш год Змеи') :
//   (num5_1 == 1906 || num5_1 == 1906+12 || num5_1 == 1906+12*2 || num5_1 == 1906+12*3 || num5_1 == 1906+12*4 || num5_1 == 1906+12*5 || num5_1 == 1906+12*6 || num5_1 == 1906+12*7 || num5_1 == 1906+12*8 || num5_1 == 1906+12*9 || num5_1 == 1906+12*10 || num5_1 == 1906+12*11 || num5_1 == 1906+12*12) ? alert('ваш год Лошади') :
//   (num5_1 == 1907 || num5_1 == 1907+12 || num5_1 == 1907+12*2 || num5_1 == 1907+12*3 || num5_1 == 1907+12*4 || num5_1 == 1907+12*5 || num5_1 == 1907+12*6 || num5_1 == 1907+12*7 || num5_1 == 1907+12*8 || num5_1 == 1907+12*9 || num5_1 == 1907+12*10 || num5_1 == 1907+12*11 || num5_1 == 1907+12*12) ? alert('ваш год Козы') :
//   (num5_1 == 1908 || num5_1 == 1908+12 || num5_1 == 1908+12*2 || num5_1 == 1908+12*3 || num5_1 == 1908+12*4 || num5_1 == 1908+12*5 || num5_1 == 1908+12*6 || num5_1 == 1908+12*7 || num5_1 == 1908+12*8 || num5_1 == 1908+12*9 || num5_1 == 1908+12*10 || num5_1 == 1908+12*11 || num5_1 == 1908+12*12) ? alert('ваш год Обезьяны') :
//   (num5_1 == 1909 || num5_1 == 1909+12 || num5_1 == 1909+12*2 || num5_1 == 1909+12*3 || num5_1 == 1909+12*4 || num5_1 == 1909+12*5 || num5_1 == 1909+12*6 || num5_1 == 1909+12*7 || num5_1 == 1909+12*8 || num5_1 == 1909+12*9 || num5_1 == 1909+12*10 || num5_1 == 1909+12*11 || num5_1 == 1909+12*12) ? alert('ваш год Петуха') :
//   (num5_1 == 1910 || num5_1 == 1910+12 || num5_1 == 1910+12*2 || num5_1 == 1910+12*3 || num5_1 == 1910+12*4 || num5_1 == 1910+12*5 || num5_1 == 1910+12*6 || num5_1 == 1910+12*7 || num5_1 == 1910+12*8 || num5_1 == 1910+12*9 || num5_1 == 1910+12*10 || num5_1 == 1910+12*11 || num5_1 == 1910+12*12) ? alert('ваш год Собаки') :
//   (num5_1 == 1911 || num5_1 == 1911+12 || num5_1 == 1911+12*2 || num5_1 == 1911+12*3 || num5_1 == 1911+12*4 || num5_1 == 1911+12*5 || num5_1 == 1911+12*6 || num5_1 == 1911+12*7 || num5_1 == 1911+12*8 || num5_1 == 1911+12*9 || num5_1 == 1911+12*10 || num5_1 == 1911+12*11 || num5_1 == 1911+12*12) ? alert('ваш год Свиньи') :

//   alert('введи свой год');
// };
// china.onclick = chinaF;

// console.log("Гороскоп рассчитан на дату 1900 - 2055 года.");


function chinaF(){
  let num5_1 = input5_1.value;
  for (let i = 0; i <= 300; i++) {// значение i <= 180 ограничит даты до 2055 года
    (num5_1 == 100 + 12 * i) ? alert('ваш год Крысы') :
    (num5_1 == 101 + 12 * i) ? alert('ваш год Быка') :
    (num5_1 == 102 + 12 * i) ? alert('ваш год Тигра') :
    (num5_1 == 103 + 12 * i) ? alert('ваш год Кролика') :
    (num5_1 == 104 + 12 * i) ? alert('ваш год Дракона') :
    (num5_1 == 105 + 12 * i) ? alert('ваш год Змеи') :
    (num5_1 == 106 + 12 * i) ? alert('ваш год Лошади') :
    (num5_1 == 107 + 12 * i) ? alert('ваш год Козы') :
    (num5_1 == 108 + 12 * i) ? alert('ваш год Обезьяны') :
    (num5_1 == 109 + 12 * i) ? alert('ваш год Петуха') :
    (num5_1 == 110 + 12 * i) ? alert('ваш год Собаки') :
    (num5_1 == 111 + 12 * i) ? alert('ваш год Свиньи') :
    '' 
  };
};
china.onclick = chinaF;

console.log("Гороскоп рассчитан на дату от 100 года н.э. до 3711 года");

